---
kind: enumMember
id: F:Autodesk.Revit.DB.BuiltInParameter.STAIRSTYPE_NUMBER_OF_INTERMEDIATE_SUPPORTS
enum: Autodesk.Revit.DB.BuiltInParameter
source: html/fb011c91-be7e-f737-28c7-3f1e1917a0e0.htm
---
# Autodesk.Revit.DB.BuiltInParameter.STAIRSTYPE_NUMBER_OF_INTERMEDIATE_SUPPORTS

"Middle Support Number": Number of intermediate supports